package com.sisensing.common.utils;

import android.content.Context;
import android.graphics.Color;

import com.sisensing.common.R;

/**
 * @ProjectName: 硅基动感
 * @Package: com.sisensing.common.utils
 * @Author: l.chen
 * @CreateDate: 2021-10-14 18:47
 * @Description:
 */
public class UMengUtils {

    public static final String[][] EVENT_ID = new String[][]{
            {"000",""},
            {"001","首页点击更换传感器"},
            {"002","首页点击横屏放大功能"},
            {"003","首页点击饮食打卡"},
            {"004","首页点击用药打卡"},
            {"005","首页点击运动打卡"},
            {"006","首页点击胰岛素打卡"},
            {"007","首页点击睡眠打卡"},
            {"008","首页点击指血打卡"},
            {"009","首页点击身体状态打卡"},
            {"010","首页点击警报图标进入警报列表页面"},
            {"011","首页点击每日血糖"},
            {"012","首页点击血糖分析"},
            {"013","首页点击个人中心"},
            {"014","手机验证码登录点击账号密码登录"},
            {"015","点击微信授权登录"},
            {"016","点击苹果授权登录"},
            {"017","账号密码登录点击手机验证码登录"},
            {"018","用户信息完善点击跳过"},
            {"019","佩戴说明页点击跳过"},
            {"020","佩戴说明最后页点击完成"},
            {"021","用药打卡跳转药物选择页"},
            {"022","胰岛素打卡跳转胰岛素选择页"},
            {"023","个人中心点击编辑资料"},
            {"024","个人中心点击设置"},
            {"025","个人中心点击我的报告"},
            {"026","个人中心点击我的医生"},
            {"027","个人中心点击我的设备"},
            {"028","个人中心点击血糖设置"},
            {"029","个人中心点击报警事件"},
            {"030","个人中心点击打卡事件"},
            {"031","个人中心点击我的关注"},
            {"032","个人中心点击使用帮助"},
            {"033","个人中心点击我的客服"},
            {"034","个人中心点击我的手表"},
            {"035","个人中心点击血糖监测"},
            {"036","个人中心点击每日血糖"},
            {"037","个人中心点击血糖分析"},
            {"038","我的关注点击分享"},
            {"039","我的设备点击更换设备"},
            {"040","点击查看数据"},
            {"041","血糖数据点击导出数据"},
            {"042","编辑资料点击完成"},
            {"043","点击更换头像"},
            {"044","点击生活习惯"},
            {"045","生活习惯页点击完成"},
            {"046","点击闹钟提醒"},
            {"047","设置点击清除缓存"},
            {"048","点击退出登录"},
            {"049","点击版本更新"},
            {"050","每日血糖点击血糖监测"},
            {"051","每日血糖点击血糖分析"},
            {"052","每日血糖点击个人中心"},
            {"053","血糖分析查看血糖报告"},
            {"054","血糖分析查看多日叠加"},
            {"055","血糖分析查看血糖分析"},
            {"056","血糖分析点击血糖监测"},
            {"057","血糖分析点击每日血糖"},
            {"058","血糖分析点击个人中心"},
    };

}
